# build.ys
read_verilog -pwires verilog_benchmarks/iodine-benchmarks/fpu/verilog/fpu.v \
		verilog_benchmarks/iodine-benchmarks/fpu/verilog/pre_norm.v \
		verilog_benchmarks/iodine-benchmarks/fpu/verilog/primitives.v \
		verilog_benchmarks/iodine-benchmarks/fpu/verilog/post_norm.v \
		verilog_benchmarks/iodine-benchmarks/fpu/verilog/except.v" \
		verilog_benchmarks/iodine-benchmarks/fpu/verilog/pre_norm_fmul.v
hierarchy -top fpu
proc
flatten
techmap -map +/dff2ff.v
delete SPISlave/clk
synth
write_smt2 -stdt -nobv -wires fpu.smt2