# build.ys
read_verilog -pwires ./verilog_benchmarks/TRNG/trng.v \
               ./verilog_benchmarks/TRNG/trng_mixer.v \
               ./verilog_benchmarks/TRNG/trng_csprng.v \
               ./verilog_benchmarks/TRNG/rosc_entropy.v \
               ./verilog_benchmarks/TRNG/avalanche_entropy.v \
               ./verilog_benchmarks/TRNG/sha512_core.v \
               ./verilog_benchmarks/TRNG/trng_csprng_fifo.v \
               ./verilog_benchmarks/TRNG/chacha_core.v \
               ./verilog_benchmarks/TRNG/chacha_qr.v \
               ./verilog_benchmarks/TRNG/sha512_w_mem.v \
               ./verilog_benchmarks/TRNG/sha512_h_constants.v \
               ./verilog_benchmarks/TRNG/sha512_k_constants.v
hierarchy -check -top trng
proc
flatten
async2sync
dffunmap
opt_clean -purge
write_smt2 -stdt -wires trng.smt2
